

// 1 задание


<?php
$i=0;
while ($i<=100) {
	if ($i%3 == 0) { 
		print $i.' ';
		$i++;
	}
	else $i++;
}
?>


// 2 задание


<?php
$i = 0;
do {	
if ($i == 0) {	
echo $i." - ноль\n";		
$i++;		
}
else if ($i % 2 == 0) {	
echo $i." - четное число\n";	
$i++;		
}	
else { 	    
echo $i." - нечетное число\n";	    
$i++;	    
}   
}
while ($i <= 10);
?>


// 3 задание


<?php
$array = [
'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт']
];
foreach($array as $index => $item)
{  
echo $index.': ';   
for ($i=0; $i<count($item); $i++)
{   
if ($i != (count($item)-1)) { 
echo $item[$i].', ';   
}   
else echo $item[$i];   
}    
echo "\n";
}
?>


// 4 задание


<?php
function translit($str) 
{    
$translit = array("а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e", "ё" => "e", "ж" => "zh",  "з" => "z", "и" => "i", "й" => "y", "к" => "k", "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r", "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "kh", "ц" => "c", "ч" => "ch",  "ш" => "sh",  "щ" => "sch", "ь" => "",  "ы" => "y", "ъ" => "", "э" => "e", "ю" => "yu", "я" => "ya", "А" => "A", "Б" => "B", "В" => "V", "Г" => "G", "Д" => "D", "Е" => "E", "Ё" => "E", "Ж" => "Zh",  "З" => "Z", "И" => "I", "Й" => "Y", "К" => "K", "Л" => "L", "М" => "M", "Н" => "N", "О" => "O", "П" => "P", "Р" => "R", "С" => "S", "Т" => "T", "У" => "U", "Ф" => "F", "Х" => "KH", "Ц" => "C", "Ч" => "Ch",  "Ш" => "Sh",  "Щ" => "Sch", "Ь" => "",  "Ы" => "Y", "Ъ" => "", "Э" => "E", "Ю" => "Yu",  "Я" => "Ya", "ь"=>"'", "ъ"=>"");    
return strtr($str, $translit);   
}
$string = "Введите строку для транслита";
echo $string."\n";
echo translit($string);
?>



// 5 задание


<?php
function replace($str) 
{  
return str_replace(' ', '_',$str); 
}
$string = "Введите строку для транслита";
echo replace($string);
?>



// 6 задание


<?php
function table() 
{
$menu = ['Главная' =>'',   
'Одежда' => array ('Мужская', 'Женская', 'Детская'),   
'Обувь' => array ('Мужская', 'Женская', 'Детская'),   
'Аксессуары' =>''   
];
echo "\n<ul>\n";
foreach($menu as $index => $item)
{
echo "<li>$index</li>\n";
if (gettype($item) == "array") {   
echo "<ul>\n";
for ($i=0; $i<count($item); $i++)
{
echo "<li>$item[$i]</li>\n";
}
echo "</ul>\n";
}
}
echo "</ul>\n";
}
?>

<!DOCTYPE html>
<body> <?php table();?></body>
</html>


// 7 задание


<?php
for ($i=0; $i<=9; print $i++.' '){}
?>



// 8 задание


<?php
$array = [
'Московская область' => ['Москва', 'Клин', 'Зеленоград'],
'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт']
];
foreach($array as $index => $item)
{   
echo $index.': ';   
for ($i=0; $i<count($item); $i++)
{   
if (substr($item[$i], 0, 2) == 'К') {  // Вопрос: При выводе var_dump(substr($item[$i], 0, 1); // string(1) "" , а при var_dump(substr($item[$i], 0, 2); // string(2) "К", почуму 0-вой элемнт равен пустой строке?
if ($i != (count($item)-1)) {         // Как этого избежать, чтобы 0-вой индекс был "К"? Сделал так же через mb_substr (легче), но хочется разобраться именно в этом моменте.
echo $item[$i].' ';  
}    
else echo $item[$i];   
}   
}
 echo "\n";   
}    
?>


// 9 задание


<?php
function TranslitReplace($str) 
{
$translit = array("а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e", "ё" => "e", "ж" => "zh",  "з" => "z", "и" => "i", "й" => "y", "к" => "k", "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r", "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "kh", "ц" => "c", "ч" => "ch",  "ш" => "sh",  "щ" => "sch", "ь" => "",  "ы" => "y", "ъ" => "", "э" => "e", "ю" => "yu", "я" => "ya", "А" => "A", "Б" => "B", "В" => "V", "Г" => "G", "Д" => "D", "Е" => "E", "Ё" => "E", "Ж" => "Zh",  "З" => "Z", "И" => "I", "Й" => "Y", "К" => "K", "Л" => "L", "М" => "M", "Н" => "N", "О" => "O", "П" => "P", "Р" => "R", "С" => "S", "Т" => "T", "У" => "U", "Ф" => "F", "Х" => "KH", "Ц" => "C", "Ч" => "Ch",  "Ш" => "Sh",  "Щ" => "Sch", "Ь" => "",  "Ы" => "Y", "Ъ" => "", "Э" => "E", "Ю" => "Yu",  "Я" => "Ya", "ь"=>"'", "ъ"=>"");  
$srsTranslit = strtr($str, $translit);
return str_replace(' ', '_',$srsTranslit); 
}
$string = "Введите строку для транслита";
echo $string."\n";
echo TranslitReplace($string);
?>


